/*
* v2.0版本
*   7月26日,||27，28|| 29， 30， 31， 8月1日，2，||3， 4|| 5日， 6日， 7日，8日，9日 // js数据结构与算法
*   // koa2框架从0开始构建预告片网站
*
*   8月13日，14，15，16 ||17， 18|| 19，20， 21， 22， 23， ||24，25|| 26， 27， 28， 29，30 // js高级程序设计
*   // node开发公众号
*
*   9月2日，3， 4， 5， 6，|| 7， 8||  // 务实CSS基础跟一些技巧
*   // vue全家桶+SSR+KOA2全栈开发美团网
*
*   9月9日，10， 11， 12， 13， || 14， 15|| 16, 17, 18, 19, 20, ||21, 22|| 23, 24, 25, 26, 27 // 深入理解计算机系统
*   // vue+vue-router+vuex+ssr实战精讲， vue源码全方位深入解析
*
*   10月7日，8， 9， 10， 11 || 12， 13|| 14， 15， 16， 17， 18 || 19， 20|| 21， 22， 23， 24， 25 // 计算机网络(自定向下方法)
*   // mysql视频教程， nginx视频教程
*
*   11月刷leetcode, 50道题
*   11月 你不知道的JS上，中， 下看完
*
*   12月刷leetcode, 50道题
*   12月 JS设计模式  (曾探版)
*
*   1月  JS设计模式
*   1月  全面系统学习CSS + 面试一步搞定
*
*
*   2月 TS基础学习
*   2月 刷面试题
*
*   3月 vue3.0学习
*   3月 刷面试题
*
*   4月 D3学习
*   4月 刷面试题
*
*   5月 react学习
*   5月 刷面试题
*
*   6月 vue3.0源码学习
*   6月 刷面试题
*
*   7月 D3源码学习
*   7月 刷面试题
*
*   8月 react源码学习
*   8月 刷面试题
*
*   9月 angular学习
*   9月 刷面试题
*
*   10月 leetcode 50题
*   10月 leetcode 50题
*
*   11月 leetcode 50题
*   11月 leetcode 50题
*
*   12月 刷面试题  投简历面试
*   12月 刷面试题  投简历面试
*
*   1月  刷面试题  投简历面试
*   1月  刷面试题  投简历面试
*
* */



/* v1.0版本
*   7月17日，18日，19日 |20 21| 22日,23日。 // ES6
*
*   7月24日，25日，26日 |27，28| 29日，30日，31日，8月1日，2日，|3，4| 5日，6日，7日，8日，9日  // JS数据结构与算法描述
*
*   8月13日，14日，15日，16日，19日，20日，21日，22日，23日，|24，25| 26日，27日，28日，29日，30日 // 精通CSS
*
*   早上
*   7月17日，18日，19日，20日，21日，22日，23日，24日，25日，26日，30日，31日，8月1日，2日，3日，4日，5日，6日，7日，8日，9日 //js高级程序设计
*
*   8月14日，15日，16日，17日，18日，19日，20日，21日，22日，23日，24日，25日，26日，27日，28日，29日，30日，31日 // 你不知道的JS，上、中、下。
*
* */
/*
*   9月份刷leetcode 50道题
*
*   9月份JS设计模式（曾探版）
*
*   10月份vue2.0源码
*
*   10月份视频vue2.0源码
*
*   11月份leetcode 50道题
*
*   11月份图解HTTP
*
*   12月份 leetcode 50道题
*   12月份 CSS世界
*
*   1月份 CSS世界
*
*   2月份 leetcode 50道题
*
*   3月份 leetcode 50道题
*   3月份 TS学习
*
*   4月份 D3学习
*   4月份 vue3.0学习
*
*   5月份 D3源码学习
*   5月份 vue3.0源码学习
*
*   6月份 leetcode 50道题
*   6月份 Node后端学习
*
*   7月份 leetcode 50道题
*   7月份 Node后端学习
*
*   8月份 leetcode 50道题
*   8月份 react学习
*
*   9月份 leetcode 50道题
*   9月份 react学习
*
*   10月份 leetcode 50道题
*   10月份 刷面试题
*
*   11月份 leetcode 50道题
*   11月份 刷面试题
*
*   12月份 leetcode 50道题
*   12月份 刷面试题
* */















































































